def replace_word(text, old_word, new_word):
    # Розділити текст на слова за пробілами та розділовими знаками
    words = text.split()
    # Пройтися по кожному слову
    for i in range(len(words)):
        # Перевірити, чи поточне слово співпадає з першим словом
        if words[i] == old_word:
            # Замінити слово новим словом
            words[i] = new_word
    # З'єднати слова назад у текст за допомогою пробілів
    replaced_text = ' '.join(words)
    return replaced_text

# Заданий текст
text = "Python - це високорівнева мова програмування, яка часто використовується для розробки різноманітних програм. Python дозволяє легко створювати програми завдяки своїй простоті та зручності. Python має велику спільноту користувачів, яка постійно розширюється. Python також відомий своєю великою кількістю бібліотек і модулів, які спрощують роботу розробників. Python використовується у багатьох сферах, включаючи веб-розробку, аналіз даних, штучний інтелект та багато іншого. Мова Python надзвичайно популярна серед початківців та досвідчених програмістів. Python - це інструмент, що постійно розвивається, і відкриває нові можливості для розробників усього світу."

# Перше слово для заміни
old_word = "Python"
# Друге слово, яке замінить перше
new_word = "Мова"

# Виклик функції для заміни
new_text = replace_word(text, old_word, new_word)
print(new_text)
